Wafleem/STM32N6-EdgeAI-CV/Application/NUCLEO-N657X0-Q/Src/main.c
        dst_row[x] = (int8_t)quantized;
      }
    }
  }
#else
  for (uint32_t y = 0; y < STAI_NETWORK_IN_1_HEIGHT; y++)
  {
    memcpy(dst + (y * row_bytes), src + (y * src_stride), row_bytes);
  }
#endif
}
#endif


/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
  Hardware_init();
  printf("TRACE: main: Hardware_init complete\n");

  /*** NN Init ****************************************************************/
  uint32_t nn_in_len = 0;
  stai_size number_output = 0;
  stai_ptr nn_out[STAI_NETWORK_OUT_NUM] = {0};
  int32_t nn_out_len[STAI_NETWORK_OUT_NUM] = {0};

  printf("TRACE: main: NeuralNetwork_init begin\n");
  NeuralNetwork_init(&nn_in_len, nn_out, &number_output, nn_out_len);
  printf("TRACE: main: NeuralNetwork_init OK input_len=%lu outputs=%lu\n",
         (unsigned long) nn_in_len, (unsigned long) number_output);

  /*** Post Processing Init ***************************************************/
  stai_network_info info;
  int ret;

  printf("TRACE: main: postprocess init begin\n");
  ret = stai_network_get_info(network_context, &info);
  printf("TRACE: main: stai_network_get_info ret=%d\n", ret);
  assert(ret == STAI_SUCCESS);
  app_postprocess_init(&pp_params, &info);
  printf("TRACE: main: postprocess init OK\n");

  /*** Camera Init ************************************************************/
  uint32_t pitch_nn = 0;
  printf("TRACE: main: CameraPipeline_Init begin\n");
  CameraPipeline_Init((uint32_t *[2]) {&lcd_bg_area.XSize, &lcd_fg_area.XSize}, (uint32_t *[2]) {&lcd_bg_area.YSize, &lcd_fg_area.YSize}, &pitch_nn);
  printf("TRACE: main: CameraPipeline_Init OK bg=%lux%lu fg=%lux%lu pitch_nn=%lu\n",
         (unsigned long) lcd_bg_area.XSize, (unsigned long) lcd_bg_area.YSize,
         (unsigned long) lcd_fg_area.XSize, (unsigned long) lcd_fg_area.YSize,
         (unsigned long) pitch_nn);

  printf("TRACE: main: Display_init begin\n");
  Display_init();
  printf("TRACE: main: Display_init OK; USB/UVC should be initialized now\n");

  /* Start LCD Display camera pipe stream */
  printf("TRACE: main: CameraPipeline_DisplayPipe_Start begin\n");
  CameraPipeline_DisplayPipe_Start(lcd_bg_buffer, CMW_MODE_CONTINUOUS);
  printf("TRACE: main: CameraPipeline_DisplayPipe_Start OK\n");

  /*** App header *************************************************************/
  printf("========================================\n");
  printf("STM32N6-GettingStarted-ObjectDetection %s (%s)\n", APP_VERSION_STRING, APP_GIT_SHA1_STRING);
  printf("Build date & time: %s %s\n", __DATE__, __TIME__);
#if defined(__GNUC__)
  printf("Compiler: GCC %d.%d.%d\n", __GNUC__, __GNUC_MINOR__, __GNUC_PATCHLEVEL__);
#elif defined(__ICCARM__)
  printf("Compiler: IAR EWARM %d.%d.%d\n", __VER__ / 1000000, (__VER__ / 1000) % 1000 ,__VER__ % 1000);
#else
  printf("Compiler: Unknown\n");
#endif
  printf("HAL: %lu.%lu.%lu\n", __STM32N6xx_HAL_VERSION_MAIN, __STM32N6xx_HAL_VERSION_SUB1, __STM32N6xx_HAL_VERSION_SUB2);
  printf("STEdgeAI Tools: %d.%d.%d\n", STAI_TOOLS_VERSION_MAJOR, STAI_TOOLS_VERSION_MINOR, STAI_TOOLS_VERSION_MICRO);
  printf("NN model: %s\n", STAI_NETWORK_ORIGIN_MODEL_NAME);
  printf("Model profile: %s\n", APP_MODEL_PROFILE_NAME);
  printf("Calibration: %s\n", APP_MODEL_CALIBRATION_NAME);
  printf("========================================\n");

  /*** App Loop ***************************************************************/
  while (1)
  {
    CameraPipeline_IspUpdate();

#if NN_INPUT_NEEDS_PREPROC
    /* Start NN camera single capture Snapshot into intermediate buffer */
    CameraPipeline_NNPipe_Start(dcmipp_out_nn, CMW_MODE_SNAPSHOT);
#else
    /* Start NN camera single capture Snapshot directly into NN input */
    CameraPipeline_NNPipe_Start(nn_in, CMW_MODE_SNAPSHOT);
#endif

    while (cameraFrameReceived == 0) {};
    cameraFrameReceived = 0;

    uint32_t ts[2] = { 0 };

#if NN_INPUT_NEEDS_PREPROC
    /*
     * Crop/copy/quantize the camera frame into the NN input buffer.
     * The DCMIPP hardware may pad each row to a 16-byte boundary, and the
     * Safal OBB model also needs uint8 camera bytes remapped into signed int8.
     */
    SCB_InvalidateDCache_by_Addr(dcmipp_out_nn, sizeof(dcmipp_out_nn));
    PreprocessCameraFrameToNNInput(dcmipp_out_nn, nn_in, pitch_nn);
    SCB_CleanInvalidateDCache_by_Addr(nn_in, nn_in_len);
#endif

    ts[0] = HAL_GetTick();
    /* run ATON inference */
    ret = stai_network_run(network_context, STAI_MODE_SYNC);
    assert(ret == 0);
    ts[1] = HAL_GetTick();

    int32_t ret = app_postprocess_run((void **) nn_out, number_output, &pp_output, &pp_params);
    assert(ret == 0);

    Display_NetworkOutput(&pp_output, ts[1] - ts[0]);
    /* Discard nn_out region (used by pp_input and pp_outputs variables) to avoid Dcache evictions during nn inference */
    for (int i = 0; i < number_output; i++)
    {
      void *tmp = nn_out[i];
      SCB_InvalidateDCache_by_Addr(tmp, nn_out_len[i]);
    }
  }
}


static void Hardware_init(void)
{
  /* Power on ICACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_ICACTIVE_Msk;

  /* Set back system and CPU clock source to HSI */
  __HAL_RCC_CPUCLK_CONFIG(RCC_CPUCLKSOURCE_HSI);
  __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);

  HAL_Init();

  SCB_EnableICache();

#if defined(USE_DCACHE)
  /* Power on DCACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_DCACTIVE_Msk;
  SCB_EnableDCache();
#endif

  SystemClock_Config();

  CONSOLE_Config();
  printf("TRACE: Hardware_init: console ready at 115200 baud\n");

  printf("TRACE: Hardware_init: NPURam_enable begin\n");
  NPURam_enable();
  printf("TRACE: Hardware_init: NPURam_enable OK\n");

  printf("TRACE: Hardware_init: Fuse_Programming begin\n");
  Fuse_Programming();
  printf("TRACE: Hardware_init: Fuse_Programming OK\n");

  printf("TRACE: Hardware_init: NPUCache_config begin\n");
  NPUCache_config();
  printf("TRACE: Hardware_init: NPUCache_config OK\n");

  /*** External NOR Flash *********************************************/
  printf("TRACE: Hardware_init: external NOR init begin\n");
  BSP_XSPI_NOR_Init_t NOR_Init;
  NOR_Init.InterfaceMode = BSP_XSPI_NOR_OPI_MODE;
  NOR_Init.TransferRate = BSP_XSPI_NOR_DTR_TRANSFER;
  BSP_XSPI_NOR_Init(0, &NOR_Init);
  BSP_XSPI_NOR_EnableMemoryMappedMode(0);
  printf("TRACE: Hardware_init: external NOR memory mapped OK\n");

  /* Set all required IPs as secure privileged */
  printf("TRACE: Hardware_init: Security_Config begin\n");
  Security_Config();
  printf("TRACE: Hardware_init: Security_Config OK\n");

